## INTRODUCTION TO PANDAS

### SERIES DATA STRUCTURES

In [4]:
s1

0    8
1    9
2    5
3    3
4    2
dtype: int64

In [1]:
import pandas as pd   #Importing pandas

In [3]:
s1 = pd.Series([8,9,5,3,2])

In [5]:
s1.dtype     # Finding out the data type

dtype('int64')

In [6]:
s1[1]         # Accessing the Second Item in the Series

9

In [7]:
print(s1+10)  # Add 10  to each number in the Series

0    18
1    19
2    15
3    13
4    12
dtype: int64

#### Adding Two Series

In [8]:
s2 = pd.Series([1,2,3,4,5])

In [9]:
print(s1 + s2)

0     9
1    11
2     8
3     7
4     7
dtype: int64

##  DATA_FRAME DATA STRUCTURE VS SERIES DATA STRUCTURE

| Feature      | **Series**                        | **DataFrame**                                      |
| ------------ | --------------------------------- | -------------------------------------------------- |
| Structure    | 1-dimensional (like a column)     | 2-dimensional (like a table with rows and columns) |
| Data Type    | Can hold one data type per Series | Can hold multiple data types across columns        |
| Indexed Like | A single column or list           | A table (rows + columns)                           |
| Used For     | Storing a single column of data   | Storing entire datasets with multiple columns      |

### Series Example

In [10]:

import pandas as pd

# A list of ages
ages = pd.Series([12, 15, 14])
# This is like one column of data.

print(ages)

0    12
1    15
2    14
dtype: int64

### DataFrame Example

In [ ]:
import pandas as pd

# A table of student names and ages
data = {
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [12, 15, 14],
    "Sex": ["F","M","M"]
}

df = pd.DataFrame(data)

print(df)
#This is like a full table (with multiple columns).

### Summary

Use Series when you're working with one column.

Use DataFrame when you're working with multiple columns or a full table

In [16]:
df.columns

Index(['Name', 'Age', 'Sex'], dtype='object')

In [18]:
df.to_excel

<bound method NDFrame.to_excel of       Name  Age Sex
0    Alice   12   F
1      Bob   15   M
2  Charlie   14   M>

In [22]:
df

      Name  Age Sex
0    Alice   12   F
1      Bob   15   M
2  Charlie   14   M

## DATA SELECTION IN A DATA FRAME